In [13]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

In [14]:
train=pd.read_csv('yds_train2018.csv')

In [15]:
train_length=train.shape[0]
train_length

79072

# Converted into Indian Currency

In [16]:
for i in range(train_length):
    
    if train.iloc[i,-2]=='Columbia':
        train.iloc[i,-1]*=0.024
        
    elif train.iloc[i,-2]=='Argentina':
        train.iloc[i,-1]*=2.48
        
    elif train.iloc[i,-2]=='Finland':
        train.iloc[i,-1]*=80.21
        
    elif train.iloc[i,-2]=='England':
        train.iloc[i,-1]*=89.55
        
    elif train.iloc[i,-2]=='Belgium':
        train.iloc[i,-1]*=80.30  
        
    elif train.iloc[i,-2]=='Denmark':
        train.iloc[i,-1]*=10.76

In [17]:
train.head()

   S_No  Year  Month  Week Merchant_ID  Product_ID    Country     Sales
0     1  2013      1     1     ar00001           1  Argentina  390600.0
1     2  2013      1     1     ar00003           1  Argentina   97650.0
2     3  2013      1     1     ar00004           1  Argentina   39060.0
3     4  2013      1     1     ar00007           1  Argentina  117180.0
4     5  2013      1     1     ar00008           1  Argentina  703080.0

In [18]:
train=train.sort_values(by=['Merchant_ID'])

In [19]:
train=train.drop(['Merchant_ID','Week','S_No'],axis=1)

In [20]:
train.head()

      Year  Month  Product_ID    Country   Sales
3637  2015      2           1  Argentina  3906.0
3381  2014     12           1  Argentina  3906.0
4719  2015     11           1  Argentina  3906.0
719   2013      5           1  Argentina  3906.0
1019  2013      7           1  Argentina  3906.0

In [21]:
train['Date'] = pd.to_datetime(train[['Year', 'Month']].assign(Day=1))

In [22]:
train.head()

      Year  Month  Product_ID    Country   Sales       Date
3637  2015      2           1  Argentina  3906.0 2015-02-01
3381  2014     12           1  Argentina  3906.0 2014-12-01
4719  2015     11           1  Argentina  3906.0 2015-11-01
719   2013      5           1  Argentina  3906.0 2013-05-01
1019  2013      7           1  Argentina  3906.0 2013-07-01

In [23]:
data=pd.DataFrame()
data=train.groupby(['Country','Product_ID','Year','Month'],as_index=False)['Sales'].sum()
print(data.shape)
print(data)

(388, 5)
       Country  Product_ID  Year  Month         Sales
0    Argentina           1  2013      1  8.517814e+07
1    Argentina           1  2013      2  7.937383e+07
2    Argentina           1  2013      3  8.067452e+07
3    Argentina           1  2013      4  8.825998e+07
4    Argentina           1  2013      5  9.619697e+07
5    Argentina           1  2013      6  8.976769e+07
6    Argentina           1  2013      7  9.209176e+07
7    Argentina           1  2013      8  8.757252e+07
8    Argentina           1  2013      9  9.532593e+07
9    Argentina           1  2013     10  1.101062e+08
10   Argentina           1  2013     11  1.129029e+08
11   Argentina           1  2013     12  8.335404e+07
12   Argentina           1  2014      1  1.106101e+08
13   Argentina           1  2014      2  1.030754e+08
14   Argentina           1  2014      3  9.165429e+07
15   Argentina           1  2014      4  1.077509e+08
16   Argentina           1  2014      5  1.013412e+08
17   Argentina           1  2014      6  1.001342e+08
18   Argentina           1  2014      7  1.077783e+08
19   Argentina           1  2014      8  1.024309e+08
20   Argentina           1  2014      9  1.085829e+08
21   Argentina           1  2014     10  1.085673e+08
22   Argentina           1  2014     11  1.050909e+08
23   Argentina           1  2014     12  1.097234e+08
24   Argentina           1  2015      1  1.155200e+08
25   Argentina           1  2015      2  8.201038e+07
26   Argentina           1  2015      3  9.390415e+07
27   Argentina           1  2015      4  8.713895e+07
28   Argentina           1  2015      5  8.820139e+07
29   Argentina           1  2015      6  1.035559e+08
..         ...         ...   ...    ...           ...
358    Finland           4  2013      5  2.642300e+09
359    Finland           4  2013      6  1.536497e+09
360    Finland           4  2013      7  2.180115e+09
361    Finland           4  2013      8  2.205179e+09
362    Finland           4  2013      9  2.719217e+09
363    Finland           4  2013     10  2.410549e+09
364    Finland           4  2013     11  2.994098e+09
365    Finland           4  2013     12  2.077376e+09
366    Finland           4  2014      1  2.283452e+09
367    Finland           4  2014      2  1.461307e+09
368    Finland           4  2014      3  3.195478e+09
369    Finland           4  2014      4  2.659643e+09
370    Finland           4  2014      5  1.909102e+09
371    Finland           4  2014      6  2.237479e+09
372    Finland           4  2014      7  2.417782e+09
373    Finland           4  2014      8  2.136275e+09
374    Finland           4  2014      9  3.049584e+09
375    Finland           4  2014     10  1.898770e+09
376    Finland           4  2014     11  2.022672e+09
377    Finland           4  2014     12  2.419861e+09
378    Finland           4  2015      1  2.462958e+09
379    Finland           4  2015      2  4.019638e+09
380    Finland           4  2015      3  7.254933e+08
381    Finland           4  2015      4  2.491902e+09
382    Finland           4  2015      5  1.960851e+09
383    Finland           4  2015      6  2.561248e+09
384    Finland           4  2015      7  2.268909e+09
385    Finland           4  2015      8  2.307250e+09
386    Finland           4  2015      9  2.311475e+09
387    Finland           4  2015     10  2.508071e+09

[388 rows x 5 columns]

In [24]:
data.to_csv('data.csv',index=False)